# Script started
SE0>rtc read
curr rtc time 1646297867.353394 s, 2022-03-03 08:57:47 
OK
SE0># Script delay (avoiding SAA)
SE0>script delayuntil 1646297935
OK
SE0># Enabling the PC and payload (and switching off with the timer of 30m for the payload and 3h for the PC)
SE0>csp txrx 4 14 600 000500302A
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0007000807
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0008000807
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0005010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0007011400
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0008011E00
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 2 minutes
SE0>script delay 120000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
No answer received
FAIL
SE0># Delay 2 seconds
SE0>script delay 2000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
No answer received
FAIL
SE0># Clear buffers
SE0>fs clear 32
OK
SE0>script delay 30000
OK
SE0>fs clear 33
OK
SE0>script delay 30000
OK
SE0>fs clear 34
OK
SE0>script delay 30000
OK
SE0>fs clear 35
OK
SE0>script delay 30000
OK
SE0>fs clear 36
OK
SE0>script delay 30000
OK
SE0>fs clear 37
OK
SE0>script delay 30000
OK
SE0>fs clear 38
OK
SE0>script delay 30000
OK
SE0>fs clear 39
OK
SE0>script delay 30000
OK
SE0>fs clear 40
OK
SE0>script delay 58000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
No answer received
FAIL
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
No answer received
FAIL
SE0>script delay 5000
OK
SE0># Command ID 3 - Operating Mode
SE0>csp txrx 12 8 3000 02
No answer received
FAIL
SE0>script delay 60000
OK
SE0># Command ID 18 - Operating Mode
SE0>csp txrx 13 8 3000 06
No answer received
FAIL
SE0>script delay 2000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
No answer received
FAIL
SE0>script delay 600000
OK
SE0>script delay 600000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
No answer received
FAIL
SE0>script delay 2000
OK
SE0># Switching the payloads OFF
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 4 14 600 0008000300
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Script finished
SE0>rtc read
curr rtc time 1646299664.765045 s, 2022-03-03 09:27:44 
OK
SE0>