txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651738658
OK
SE0>rtc read
curr rtc time 1651738658.004669 s, 2022-05-05 08:17:38 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651740758
OK
SE0>rtc read
curr rtc time 1651740758.005737 s, 2022-05-05 08:52:38 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651744058
OK
SE0>rtc read
curr rtc time 1651744058.010223 s, 2022-05-05 09:47:38 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651746158
OK
SE0>rtc read
curr rtc time 1651746158.005157 s, 2022-05-05 10:22:38 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: F8
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: F8
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651749458
OK
SE0>rtc read
curr rtc time 1651749458.006805 s, 2022-05-05 11:17:38 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># fs list
SE0>fs list
ID  Name	   Status  Type     Entries	  Size
0   fwUpdMain      OK      STATIC   1324          917 kB
1   confMain       Locked  STATIC   3422          130 kB
2   confMainB      Locked  STATIC   3422          130 kB
3   confFall       Locked  STATIC   3422          130 kB
4   confFallB      Locked  STATIC   3422          130 kB
5   generalT       OK      LOG      4747/51471    1300 kB
6   dataT          OK      LOG      4747/56118    13004 kB
7   startupT       OK      LOG      29/9432       650 kB
8   err            Empty   LOG      -             6502 kB
9   use            OK      LOG      133/48015     6502 kB
10  fwUpGoldenD    Locked  STATIC   1             65 kB
11  fwUpGolden     Locked  STATIC   1324          1040 kB
12  SE0state       OK      LOG      70/1204       130 kB
13  SE1state       Empty   LOG      -             130 kB
14  ScriptExe1     OK      STATIC   334           65 kB
15  ScriptExe2     Empty   STATIC   -             65 kB
16  ScriptExe3     Empty   STATIC   -             65 kB
17  ScriptExe4     Empty   STATIC   -             65 kB
18  ScriptExe5     Empty   STATIC   -             65 kB
19  ScriptLog1     OK      LOG      485/485       130 kB
20  ScriptLog2     Empty   LOG      -             130 kB
21  ScriptLog3     Empty   LOG      -             130 kB
22  ScriptLog4     Empty   LOG      -             130 kB
23  ScriptLog5     Empty   LOG      -             130 kB
32  OrbMonitor     OK      LOG      1197/57600    16769 kB
33  TGFevt1        Empty   LOG      -             209612 kB
34  TGFevt2        Empty   LOG      -             209612 kB
35  NonVeto1       OK      LOG      23127/764160  209612 kB
36  NonVeto2       OK      LOG      86487/764160  209612 kB
37  Veto1          OK      LOG      12913/111360  31441 kB
38  Veto2          OK      LOG      49379/111360  31441 kB
39  GRBevt1        Empty   LOG      -             105854 kB
40  GRBevt2        Empty   LOG      -             105854 kB
OK
SE0>rtc read
curr rtc time 1651749524.148071 s, 2022-05-05 11:18:44 
OK
SE0># Script delay 5 May 2022 14:46:49.480 (Avoiding SAA)
SE0>script delayuntil 1651762309
OK
SE0>rtc read
curr rtc time 1651762309.006317 s, 2022-05-05 14:51:49 
OK
SE0># Enabling the PC and payloads (and switching off with the timer of 60m for the payloads and 3h for the PC)
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651765609
OK
SE0>rtc read
curr rtc time 1651765609.002411 s, 2022-05-05 15:46:49 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651767709
OK
SE0>rtc read
curr rtc time 1651767709.005554 s, 2022-05-05 16:21:49 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651771009
OK
SE0>rtc read
curr rtc time 1651771009.000275 s, 2022-05-05 17:16:49 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
No answer received
FAIL
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651773109
OK
SE0>rtc read
curr rtc time 1651773109.003571 s, 2022-05-05 17:51:49 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651776409
OK
SE0>rtc read
curr rtc time 1651776409.001617 s, 2022-05-05 18:46:49 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
No answer received
FAIL
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651778509
OK
SE0>rtc read
curr rtc time 1651778509.009644 s, 2022-05-05 19:21:49 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651781809
OK
SE0>rtc read
curr rtc time 1651781809.002014 s, 2022-05-05 20:16:49 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># fs list
SE0>fs list
ID  Name	   Status  Type     Entries	  Size
0   fwUpdMain      OK      STATIC   1324          917 kB
1   confMain       Locked  STATIC   3422          130 kB
2   confMainB      Locked  STATIC   3422          130 kB
3   confFall       Locked  STATIC   3422          130 kB
4   confFallB      Locked  STATIC   3422          130 kB
5   generalT       OK      LOG      4801/51471    1300 kB
6   dataT          OK      LOG      4801/56118    13004 kB
7   startupT       OK      LOG      29/9432       650 kB
8   err            Empty   LOG      -             6502 kB
9   use            OK      LOG      133/48015     6502 kB
10  fwUpGoldenD    Locked  STATIC   1             65 kB
11  fwUpGolden     Locked  STATIC   1324          1040 kB
12  SE0state       OK      LOG      70/1204       130 kB
13  SE1state       Empty   LOG      -             130 kB
14  ScriptExe1     OK      STATIC   334           65 kB
15  ScriptExe2     Empty   STATIC   -             65 kB
16  ScriptExe3     Empty   STATIC   -             65 kB
17  ScriptExe4     Empty   STATIC   -             65 kB
18  ScriptExe5     Empty   STATIC   -             65 kB
19  ScriptLog1     OK      LOG      485/485       130 kB
20  ScriptLog2     Empty   LOG      -             130 kB
21  ScriptLog3     Empty   LOG      -             130 kB
22  ScriptLog4     Empty   LOG      -             130 kB
23  ScriptLog5     Empty   LOG      -             130 kB
32  OrbMonitor     OK      LOG      1747/57600    16769 kB
33  TGFevt1        Empty   LOG      -             209612 kB
34  TGFevt2        Empty   LOG      -             209612 kB
35  NonVeto1       OK      LOG      33644/764160  209612 kB
36  NonVeto2       OK      LOG      131426/764160  209612 kB
37  Veto1          OK      LOG      20672/111360  31441 kB
38  Veto2          OK      LOG      75446/111360  31441 kB
39  GRBevt1        Empty   LOG      -             105854 kB
40  GRBevt2        Empty   LOG      -             105854 kB
OK
SE0>rtc read
curr rtc time 1651781875.078217 s, 2022-05-05 20:17:55 
OK
SE0># Script delay 6 May 2022 00:26:19.391 (Avoiding SAA)
SE0>script delayuntil 1651797079
OK
SE0>rtc read
curr rtc time 1651797079.007568 s, 2022-05-06 00:31:19 
OK
SE0># Enabling the PC and payloads (and switching off with the timer of 60m for the payloads and 3h for the PC)
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651800379
OK
SE0>rtc read
curr rtc time 1651800379.001801 s, 2022-05-06 01:26:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651802479
OK
SE0>rtc read
curr rtc time 1651802479.000305 s, 2022-05-06 02:01:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651805779
OK
SE0>rtc read
curr rtc time 1651805779.006195 s, 2022-05-06 02:56:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651807879
OK
SE0>rtc read
curr rtc time 1651807879.005646 s, 2022-05-06 03:31:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651811179
OK
SE0>rtc read
curr rtc time 1651811179.009247 s, 2022-05-06 04:26:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651813279
OK
SE0>rtc read
curr rtc time 1651813279.000397 s, 2022-05-06 05:01:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651816579
OK
SE0>rtc read
curr rtc time 1651816579.002472 s, 2022-05-06 05:56:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651818679
OK
SE0>rtc read
curr rtc time 1651818679.000824 s, 2022-05-06 06:31:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
No answer received
FAIL
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651821979
OK
SE0>rtc read
curr rtc time 1651821979.009308 s, 2022-05-06 07:26:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651824079
OK
SE0>rtc read
curr rtc time 1651824079.003876 s, 2022-05-06 08:01:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651827379
OK
SE0>rtc read
curr rtc time 1651827379.001251 s, 2022-05-06 08:56:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651829479
OK
SE0>rtc read
curr rtc time 1651829479.005615 s, 2022-05-06 09:31:19 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651832779
OK
SE0>rtc read
curr rtc time 1651832779.002075 s, 2022-05-06 10:26:19 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># fs list
SE0>fs list
ID  Name	   Status  Type     Entries	  Size
0   fwUpdMain      OK      STATIC   1324          917 kB
1   confMain       Locked  STATIC   3422          130 kB
2   confMainB      Locked  STATIC   3422          130 kB
3   confFall       Locked  STATIC   3422          130 kB
4   confFallB      Locked  STATIC   3422          130 kB
5   generalT       OK      LOG      4886/51471    1300 kB
6   dataT          OK      LOG      4886/56118    13004 kB
7   startupT       OK      LOG      29/9432       650 kB
8   err            Empty   LOG      -             6502 kB
9   use            OK      LOG      133/48015     6502 kB
10  fwUpGoldenD    Locked  STATIC   1             65 kB
11  fwUpGolden     Locked  STATIC   1324          1040 kB
12  SE0state       OK      LOG      70/1204       130 kB
13  SE1state       Empty   LOG      -             130 kB
14  ScriptExe1     OK      STATIC   334           65 kB
15  ScriptExe2     Empty   STATIC   -             65 kB
16  ScriptExe3     Empty   STATIC   -             65 kB
17  ScriptExe4     Empty   STATIC   -             65 kB
18  ScriptExe5     Empty   STATIC   -             65 kB
19  ScriptLog1     OK      LOG      485/485       130 kB
20  ScriptLog2     Empty   LOG      -             130 kB
21  ScriptLog3     Empty   LOG      -             130 kB
22  ScriptLog4     Empty   LOG      -             130 kB
23  ScriptLog5     Empty   LOG      -             130 kB
32  OrbMonitor     OK      LOG      2805/57600    16769 kB
33  TGFevt1        Empty   LOG      -             209612 kB
34  TGFevt2        Empty   LOG      -             209612 kB
35  NonVeto1       OK      LOG      51730/764160  209612 kB
36  NonVeto2       OK      LOG      210039/764160  209612 kB
37  Veto1          OK      LOG      34607/111360  31441 kB
38  Veto2          OK      LOG      111360/111360  31441 kB
39  GRBevt1        Empty   LOG      -             105854 kB
40  GRBevt2        Empty   LOG      -             105854 kB
OK
SE0>rtc read
curr rtc time 1651832848.289062 s, 2022-05-06 10:27:28 
OK
SE0># Script delay 6 May 2022 15:27:39.523 (Avoiding SAA)
SE0>script delayuntil 1651851159
OK
SE0>rtc read
curr rtc time 1651851159.000244 s, 2022-05-06 15:32:39 
OK
SE0># Enabling the PC and payloads (and switching off with the timer of 60m for the payloads and 3h for the PC)
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651854459
OK
SE0>rtc read
curr rtc time 1651854459.000946 s, 2022-05-06 16:27:39 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651856559
OK
SE0>rtc read
curr rtc time 1651856559.009888 s, 2022-05-06 17:02:39 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: F8
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
No answer received
FAIL
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651859859
OK
SE0>rtc read
curr rtc time 1651859859.001129 s, 2022-05-06 17:57:39 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#####################################
SE0>## Payload powering on during orbit ##
SE0>#####################################
SE0>script delayuntil 1651861959
OK
SE0>rtc read
curr rtc time 1651861959.002075 s, 2022-05-06 18:32:39 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 3 minutes
SE0>script delay 180000
OK
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>#Query Scenario
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>#Query Scenario
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 25 - Suspended Mode
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 26 - Suspended Mode
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 20 seconds
SE0>script delay 20000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 27 - Awakening Mode
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 28 - Awakening Mode
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 60 seconds
SE0>script delay 60000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 9 - Noise Mode
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 20 - Noise Mode
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 5 seconds
SE0>script delay 5000
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Command ID 1 - Default Mode
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Command ID 2 - Default Mode
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 180 seconds
SE0>script delay 180000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 40 seconds
SE0>script delay 40000
OK
SE0># CUSTOM SCENARIO ID 12
SE0>csp txrx 12 9 3000 0F0F0F09400FE8039001E803
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># CUSTOM SCENARIO ID 13
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Switch off after 55 minutes
SE0>script delayuntil 1651865259
OK
SE0>rtc read
curr rtc time 1651865259.000366 s, 2022-05-06 19:27:39 
OK
SE0># Shutdown ID 12
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 10 seconds
SE0>script delay 10000
OK
SE0># Shutdown ID 13
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># Delay 30 seconds
SE0>script delay 30000
OK
SE0># Switching the payload POWER SUPPLY to OFF
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0># fs list
SE0>fs list
ID  Name	   Status  Type     Entries	  Size
0   fwUpdMain      OK      STATIC   1324          917 kB
1   confMain       Locked  STATIC   3422          130 kB
2   confMainB      Locked  STATIC   3422          130 kB
3   confFall       Locked  STATIC   3422          130 kB
4   confFallB      Locked  STATIC   3422          130 kB
5   generalT       OK      LOG      4940/51471    1300 kB
6   dataT          OK      LOG      4940/56118    13004 kB
7   startupT       OK      LOG      29/9432       650 kB
8   err            Empty   LOG      -             6502 kB
9   use            OK      LOG      133/48015     6502 kB
10  fwUpGoldenD    Locked  STATIC   1             65 kB
11  fwUpGolden     Locked  STATIC   1324          1040 kB
12  SE0state       OK      LOG      70/1204       130 kB
13  SE1state       Empty   LOG      -             130 kB
14  ScriptExe1     OK      STATIC   334           65 kB
15  ScriptExe2     Empty   STATIC   -             65 kB
16  ScriptExe3     Empty   STATIC   -             65 kB
17  ScriptExe4     Empty   STATIC   -             65 kB
18  ScriptExe5     Empty   STATIC   -             65 kB
19  ScriptLog1     OK      LOG      485/485       130 kB
20  ScriptLog2     Empty   LOG      -             130 kB
21  ScriptLog3     Empty   LOG      -             130 kB
22  ScriptLog4     Empty   LOG      -             130 kB
23  ScriptLog5     Empty   LOG      -             130 kB
32  OrbMonitor     OK      LOG      3209/57600    16769 kB
33  TGFevt1        Empty   LOG      -             209612 kB
34  TGFevt2        Empty   LOG      -             209612 kB
35  NonVeto1       OK      LOG      59050/764160  209612 kB
36  NonVeto2       OK      LOG      243617/764160  209612 kB
37  Veto1          OK      LOG      39244/111360  31441 kB
38  Veto2          OK      LOG      111360/111360  31441 kB
39  GRBevt1        Empty   LOG      -             105854 kB
40  GRBevt2        Empty   LOG      -             105854 kB
OK
SE0>rtc read
curr rtc time 1651865325.143616 s, 2022-05-06 19:28:45 
OK
SE0># Script delay 6 May 2022 23:34:43.576 (Avoiding SAA)
SE0>script delayuntil 1651880383
OK
SE0>script delayuntil 1652135610
Wrong time stamp.
FAIL
SE0>rtc read
curr rtc time 1652142143.345917 s, 2022-05-10 00:22:23 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652138910
Wrong time stamp.
FAIL
SE0>rtc read
curr rtc time 1652142771.323212 s, 2022-05-10 00:32:51 
OK
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652141010
Wrong time stamp.
FAIL
SE0>rtc read
curr rtc time 1652142839.329865 s, 2022-05-10 00:33:59 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652144310
OK
SE0>rtc read
curr rtc time 1652144310.003601 s, 2022-05-10 00:58:30 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652146410
OK
SE0>rtc read
curr rtc time 1652146410.008911 s, 2022-05-10 01:33:30 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652149710
OK
SE0>rtc read
curr rtc time 1652149710.001770 s, 2022-05-10 02:28:30 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652151810
OK
SE0>rtc read
curr rtc time 1652151810.002014 s, 2022-05-10 03:03:30 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
No answer received
FAIL
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652155110
OK
SE0>rtc read
curr rtc time 1652155110.001709 s, 2022-05-10 03:58:30 
OK
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652157210
OK
SE0>rtc read
curr rtc time 1652157210.000671 s, 2022-05-10 04:33:30 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652160510
OK
SE0>rtc read
curr rtc time 1652160510.006622 s, 2022-05-10 05:28:30 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652162610
OK
SE0>rtc read
curr rtc time 1652162610.002014 s, 2022-05-10 06:03:30 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652165910
OK
SE0>rtc read
curr rtc time 1652165910.009369 s, 2022-05-10 06:58:30 
OK
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652168010
OK
SE0>rtc read
curr rtc time 1652168010.003540 s, 2022-05-10 07:33:30 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652171310
OK
SE0>rtc read
curr rtc time 1652171310.001251 s, 2022-05-10 08:28:30 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>rtc read
curr rtc time 1652219580.049286 s, 2022-05-10 21:53:00 
OK
SE0>script delayuntil 1652218833
Wrong time stamp.
FAIL
SE0>rtc read
curr rtc time 1652219580.049622 s, 2022-05-10 21:53:00 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>fs list
ID  Name	   Status  Type     Entries	  Size
0   fwUpdMain      OK      STATIC   1324          917 kB
1   confMain       Locked  STATIC   3422          130 kB
2   confMainB      Locked  STATIC   3422          130 kB
3   confFall       Locked  STATIC   3422          130 kB
4   confFallB      Locked  STATIC   3422          130 kB
5   generalT       OK      LOG      5531/51471    1300 kB
6   dataT          OK      LOG      5531/56118    13004 kB
7   startupT       OK      LOG      29/9432       650 kB
8   err            Empty   LOG      -             6502 kB
9   use            OK      LOG      144/48015     6502 kB
10  fwUpGoldenD    Locked  STATIC   1             65 kB
11  fwUpGolden     Locked  STATIC   1324          1040 kB
12  SE0state       OK      LOG      78/1204       130 kB
13  SE1state       Empty   LOG      -             130 kB
14  ScriptExe1     OK      STATIC   325           65 kB
15  ScriptExe2     Empty   STATIC   -             65 kB
16  ScriptExe3     Empty   STATIC   -             65 kB
17  ScriptExe4     Empty   STATIC   -             65 kB
18  ScriptExe5     Empty   STATIC   -             65 kB
19  ScriptLog1     OK      LOG      485/485       130 kB
20  ScriptLog2     Empty   LOG      -             130 kB
21  ScriptLog3     Empty   LOG      -             130 kB
22  ScriptLog4     Empty   LOG      -             130 kB
23  ScriptLog5     Empty   LOG      -             130 kB
32  OrbMonitor     OK      LOG      946/57600     16769 kB
33  TGFevt1        Empty   LOG      -             209612 kB
34  TGFevt2        Empty   LOG      -             209612 kB
35  NonVeto1       OK      LOG      74503/764160  209612 kB
36  NonVeto2       OK      LOG      267957/764160  209612 kB
37  Veto1          OK      LOG      51860/111360  31441 kB
38  Veto2          OK      LOG      111360/111360  31441 kB
39  GRBevt1        Empty   LOG      -             105854 kB
40  GRBevt2        Empty   LOG      -             105854 kB
OK
SE0>fs clear 32
OK
SE0>script delay 30000
OK
SE0>fs clear 33
OK
SE0>script delay 30000
OK
SE0>fs clear 34
OK
SE0>script delay 30000
OK
SE0>fs clear 35
OK
SE0>script delay 30000
OK
SE0>fs clear 36
OK
SE0>script delay 30000
OK
SE0>fs clear 37
OK
SE0>script delay 30000
OK
SE0>fs clear 38
OK
SE0>script delay 30000
OK
SE0>fs clear 39
OK
SE0>script delay 30000
OK
SE0>fs clear 40
OK
SE0>script delay 30000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652222133
OK
SE0>rtc read
curr rtc time 1652222133.004303 s, 2022-05-10 22:35:33 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652224233
OK
SE0>rtc read
curr rtc time 1652224233.008514 s, 2022-05-10 23:10:33 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
No answer received
FAIL
SE0>script delayuntil 1652227533
OK
SE0>rtc read
curr rtc time 1652227533.008362 s, 2022-05-11 00:05:33 
OK
SE0>csp txrx 12 4 3000 08
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
No answer received
FAIL
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652229633
OK
SE0>rtc read
curr rtc time 1652229633.001556 s, 2022-05-11 00:40:33 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652232933
OK
SE0>rtc read
curr rtc time 1652232933.005432 s, 2022-05-11 01:35:33 
OK
SE0>csp txrx 12 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 30000
OK
SE0>csp txrx 4 14 600 0008000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 4 14 600 000A000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 4 14 600 0007000000
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delayuntil 1652235033
OK
SE0>rtc read
curr rtc time 1652235033.000366 s, 2022-05-11 02:10:33 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 60000
OK
SE0>csp txrx 12 8 3000 08
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 08
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 13 8 3000 01
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 5000
OK
SE0>csp txrx 12 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 12 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 8 3000 00
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 40000
OK
SE0>csp txrx 12 9 3000 0F0F0F09400F001690010016
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 9 3000 0F0F0F09B80B041008076810
Answer: 00
Bytes: 1
Flags: 0x# Start Of Script 11 May 2022 20:41:57.569
SE0># The firs collection skipped because there was no pass scheduled before the beginning of the collection.
SE0>script delayuntil 1652307417
Wrong time stamp.
FAIL
SE0>rtc read
curr rtc time 1652314318.150177 s, 2022-05-12 00:11:58 
OK
SE0>csp txrx 4 14 600 0007010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 000A010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 6000
OK
SE0>csp txrx 4 14 600 0008010100
Answer: 0000
Bytes: 2
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 180000
OK
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
No answer received
FAIL
SE0>csp txrx 12 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>csp txrx 13 8 3000 0F
Answer: FF
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
No answer received
FAIL
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 01
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 01
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 20000
OK
SE0>csp txrx 12 4 3000 02
Answer: 00
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 12 4 3000 02
Answer: FE
Bytes: 1
Flags: 0x00 (frag=0, HMAC=0, XTEA=0, RDP=0, CRC32=0)
OK
SE0>script delay 10000
OK
SE0>csp txrx 13 4 3000 02
Answer: 